In [ ]:
data = time, param, value
                machinevol,

In [ ]:

df.withColumn('time_hours',unix.to_timestamp(col('time'),format ='YYYY-mm-dd HH'))

df.groupBy(['time_hours','param'])

In [ ]:
#json file into dic

import json
json_string =""
json_dict = json.loads(json_string)

In [ ]:
CALL name_stored(param)

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as F

In [2]:
spark = SparkSession.builder.appName("example").getOrCreate()

In [6]:
data = [
    ('2024-10-05 12:34:56', 'param1', 10),
    ('2024-10-05 12:45:00', 'param1', 20),
    ('2024-10-05 13:05:00', 'param2', 30),
    ('2024-10-05 13:30:00', 'param1', 40),
]

In [7]:
df = spark.createDataFrame(data, ['time', 'param', 'value'])

In [8]:
df = df.withColumn('time', F.to_timestamp('time'))

In [10]:
result = df.groupBy(F.date_trunc('hour',F.col('time')).alias('time_hours'), 'param') \
    .agg(F.avg('value').alias('avg_value'))

In [11]:
result.show()

+-------------------+------+---------+
|         time_hours| param|avg_value|
+-------------------+------+---------+
|2024-10-05 12:00:00|param1|     15.0|
|2024-10-05 13:00:00|param2|     30.0|
|2024-10-05 13:00:00|param1|     40.0|
+-------------------+------+---------+

In [13]:
df.groupBy('param').count().orderBy('count',ascending=False).show()

+------+-----+
| param|count|
+------+-----+
|param1|    3|
|param2|    1|
+------+-----+

In [15]:
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, IntegerType, StringType, FloatType

In [16]:
schema = StructType([
    StructField("emp_id", IntegerType(), True),       # Employee ID
    StructField("emp_name", StringType(), True),     # Employee Name
    StructField("emp_department", StringType(), True), # Employee Department
    StructField("emp_salary", FloatType(), True)      # Employee Salary
])

In [17]:
data = [
    # Engineering Department
    (1, "Alice Johnson", "Engineering", 75000.0),
    (2, "Bob Smith", "Engineering", 80000.0),
    (3, "Charlie Brown", "Engineering", 72000.0),
    (4, "David Wilson", "Engineering", 68000.0),
    (5, "Eva Green", "Engineering", 90000.0),
    (6, "Frank Wright", "Engineering", 85000.0),
    
    # HR Department
    (7, "Gina Roberts", "HR", 60000.0),
    (8, "Henry Ford", "HR", 62000.0),
    (9, "Ivy Adams", "HR", 58000.0),
    (10, "Jack Nelson", "HR", 65000.0),
    (11, "Kathy Lee", "HR", 59000.0),
    (12, "Laura King", "HR", 61000.0),
    
    # Finance Department
    (13, "Michael Scott", "Finance", 80000.0),
    (14, "Nina Patel", "Finance", 82000.0),
    (15, "Oscar Martinez", "Finance", 78000.0),
    (16, "Pam Beesly", "Finance", 77000.0),
    (17, "Quinn Kim", "Finance", 79000.0),
    (18, "Rita Thomas", "Finance", 81000.0),

    # Marketing Department
    (19, "Sam Brown", "Marketing", 65000.0),
    (20, "Tina Turner", "Marketing", 68000.0),
    (21, "Ursula White", "Marketing", 67000.0),
    (22, "Victor Hugo", "Marketing", 66000.0),
    (23, "Wendy Lee", "Marketing", 69000.0),
    (24, "Xena Gold", "Marketing", 72000.0)
]

In [21]:
df = spark.createDataFrame(data, schema)

In [22]:
df.show(24)

+------+--------------+--------------+----------+
|emp_id|      emp_name|emp_department|emp_salary|
+------+--------------+--------------+----------+
|     1| Alice Johnson|   Engineering|   75000.0|
|     2|     Bob Smith|   Engineering|   80000.0|
|     3| Charlie Brown|   Engineering|   72000.0|
|     4|  David Wilson|   Engineering|   68000.0|
|     5|     Eva Green|   Engineering|   90000.0|
|     6|  Frank Wright|   Engineering|   85000.0|
|     7|  Gina Roberts|            HR|   60000.0|
|     8|    Henry Ford|            HR|   62000.0|
|     9|     Ivy Adams|            HR|   58000.0|
|    10|   Jack Nelson|            HR|   65000.0|
|    11|     Kathy Lee|            HR|   59000.0|
|    12|    Laura King|            HR|   61000.0|
|    13| Michael Scott|       Finance|   80000.0|
|    14|    Nina Patel|       Finance|   82000.0|
|    15|Oscar Martinez|       Finance|   78000.0|
|    16|    Pam Beesly|       Finance|   77000.0|
|    17|     Quinn Kim|       Finance|   79000.0|
|    18|   Rita Thomas|       Finance|   81000.0|
|    19|     Sam Brown|     Marketing|   65000.0|
|    20|   Tina Turner|     Marketing|   68000.0|
|    21|  Ursula White|     Marketing|   67000.0|
|    22|   Victor Hugo|     Marketing|   66000.0|
|    23|     Wendy Lee|     Marketing|   69000.0|
|    24|     Xena Gold|     Marketing|   72000.0|
+------+--------------+--------------+----------+

In [23]:
third_highest_sal = df.orderBy(F.col('emp_salary').desc()).limit(3).tail(1)

In [25]:
print(third_highest_sal)

[Row(emp_id=14, emp_name='Nina Patel', emp_department='Finance', emp_salary=82000.0)]

In [26]:
from pyspark.sql import Window

In [32]:
window = Window.orderBy(F.col('emp_salary').desc())

df_with_rank = df.withColumn('rank',F.dense_rank().over(window))

In [33]:
df_with_rank.filter(F.col('rank')==3).show()

+------+----------+--------------+----------+----+
|emp_id|  emp_name|emp_department|emp_salary|rank|
+------+----------+--------------+----------+----+
|    14|Nina Patel|       Finance|   82000.0|   3|
+------+----------+--------------+----------+----+

In [34]:
df_with_rank.show(26)

+------+--------------+--------------+----------+----+
|emp_id|      emp_name|emp_department|emp_salary|rank|
+------+--------------+--------------+----------+----+
|     5|     Eva Green|   Engineering|   90000.0|   1|
|     6|  Frank Wright|   Engineering|   85000.0|   2|
|    14|    Nina Patel|       Finance|   82000.0|   3|
|    18|   Rita Thomas|       Finance|   81000.0|   4|
|     2|     Bob Smith|   Engineering|   80000.0|   5|
|    13| Michael Scott|       Finance|   80000.0|   5|
|    17|     Quinn Kim|       Finance|   79000.0|   6|
|    15|Oscar Martinez|       Finance|   78000.0|   7|
|    16|    Pam Beesly|       Finance|   77000.0|   8|
|     1| Alice Johnson|   Engineering|   75000.0|   9|
|     3| Charlie Brown|   Engineering|   72000.0|  10|
|    24|     Xena Gold|     Marketing|   72000.0|  10|
|    23|     Wendy Lee|     Marketing|   69000.0|  11|
|     4|  David Wilson|   Engineering|   68000.0|  12|
|    20|   Tina Turner|     Marketing|   68000.0|  12|
|    21|  Ursula White|     Marketing|   67000.0|  13|
|    22|   Victor Hugo|     Marketing|   66000.0|  14|
|    10|   Jack Nelson|            HR|   65000.0|  15|
|    19|     Sam Brown|     Marketing|   65000.0|  15|
|     8|    Henry Ford|            HR|   62000.0|  16|
|    12|    Laura King|            HR|   61000.0|  17|
|     7|  Gina Roberts|            HR|   60000.0|  18|
|    11|     Kathy Lee|            HR|   59000.0|  19|
|     9|     Ivy Adams|            HR|   58000.0|  20|
+------+--------------+--------------+----------+----+

In [35]:
part_window = Window.partitionBy('emp_department').orderBy(F.col('emp_salary').desc())

df_with_part_window = df.withColumn('rank',F.dense_rank().over(part_window))

In [36]:
df_with_part_window.show(34)

+------+--------------+--------------+----------+----+
|emp_id|      emp_name|emp_department|emp_salary|rank|
+------+--------------+--------------+----------+----+
|     5|     Eva Green|   Engineering|   90000.0|   1|
|     6|  Frank Wright|   Engineering|   85000.0|   2|
|     2|     Bob Smith|   Engineering|   80000.0|   3|
|     1| Alice Johnson|   Engineering|   75000.0|   4|
|     3| Charlie Brown|   Engineering|   72000.0|   5|
|     4|  David Wilson|   Engineering|   68000.0|   6|
|    14|    Nina Patel|       Finance|   82000.0|   1|
|    18|   Rita Thomas|       Finance|   81000.0|   2|
|    13| Michael Scott|       Finance|   80000.0|   3|
|    17|     Quinn Kim|       Finance|   79000.0|   4|
|    15|Oscar Martinez|       Finance|   78000.0|   5|
|    16|    Pam Beesly|       Finance|   77000.0|   6|
|    10|   Jack Nelson|            HR|   65000.0|   1|
|     8|    Henry Ford|            HR|   62000.0|   2|
|    12|    Laura King|            HR|   61000.0|   3|
|     7|  Gina Roberts|            HR|   60000.0|   4|
|    11|     Kathy Lee|            HR|   59000.0|   5|
|     9|     Ivy Adams|            HR|   58000.0|   6|
|    24|     Xena Gold|     Marketing|   72000.0|   1|
|    23|     Wendy Lee|     Marketing|   69000.0|   2|
|    20|   Tina Turner|     Marketing|   68000.0|   3|
|    21|  Ursula White|     Marketing|   67000.0|   4|
|    22|   Victor Hugo|     Marketing|   66000.0|   5|
|    19|     Sam Brown|     Marketing|   65000.0|   6|
+------+--------------+--------------+----------+----+

In [41]:
third_highest_each_dept = df_with_part_window.filter(F.col('rank')==3)
third_highest_each_dept.select('emp_department','emp_id','emp_name','emp_salary','rank').show()

+--------------+------+-------------+----------+----+
|emp_department|emp_id|     emp_name|emp_salary|rank|
+--------------+------+-------------+----------+----+
|   Engineering|     2|    Bob Smith|   80000.0|   3|
|       Finance|    13|Michael Scott|   80000.0|   3|
|            HR|    12|   Laura King|   61000.0|   3|
|     Marketing|    20|  Tina Turner|   68000.0|   3|
+--------------+------+-------------+----------+----+